[
    {
        "id": 1,
        "name": "Push up",
        "type": "Strength",
        "muscle": "Chest",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Place your hands firmly on the ground, directly under shoulders.\nFlatten your back so your entire body is straight and slowly lower your body\nDraw shoulder blades back and down, keeping elbows tucked close to your body\nExhale as you push back to the starting position."
    },
    {
        "id": 2,
        "name": "Dips",
        "type": "Strength",
        "muscle": "Chest",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Hold your body with arms locked above the equipment\nLower your body slowly while leaning forward, flare out your elbows\nRaise your body above the bars until your arms are locked."  
    },
    {
        "id": 3,
        "name": "Incline Push Up",
        "type": "Strength",
        "muscle": "Chest",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Stand facing bench or sturdy elevated platform.\nPlace hands on edge of bench or platform, slightly wider than shoulder width.\nSlowly lower your body until your chest almost touches the bench.\nPush body up until arms are extended."  
    },
    {
        "id": 4,
        "name": "Elevated Pike Press",
        "type": "Strength",
        "muscle": "Traps",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Use a bench or an object to elevate your feet.\nLower your head towards the floor by bending your elbows\nPush through your hands and return to the starting pike position.\nRepeat"  
    },
    {
        "id": 5,
        "name": "Elevated Pike Shoulder Shrug",
        "type": "Strength",
        "muscle": "Traps",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Use a bench or an object like a chair to elevate your feet.\nSlowly lower your body (scapula) while keeping your elbows locked (this is key)\nSlowly raise your body back to the start position."  
    },
    {
        "id": 6,
        "name": "Traps Stretch Variation One",
        "type": "Stretch",
        "muscle": "Traps",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Stand upright with your feet shoulder width apart.\nPlace your left hand on your head and gently pull your head down towards your left shoulder. Then return to centre point.\nRepeat, using your right hand pulling towards your right shoulder."  
    },
    {
        "id": 7,
        "name": "Elevated Pike Press",
        "type": "Strength",
        "muscle": "Shoulders",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Use a bench or an object to elevate your feet.\nLower your head towards the floor by bending your elbows\nPush through your hands and return to the starting pike position.\nRepeat"   
    },
    {
        "id": 8,
        "name": "Elevated Pike Shoulder Shrug",
        "type": "Strength",
        "muscle": "Shoulders",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Use a bench or an object like a chair to elevate your feet.\nSlowly lower your body (scapula) while keeping your elbows locked (this is key)\nSlowly raise your body back to the start position."  
    },
    {
        "id": 9,
        "name": "Barbell Bench Press",
        "type": "Strength",
        "muscle": "Shoulders",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Lay flat on the bench with your feet on the ground. With straight arms unrack the bar.\nLower the bar to your mid chest\nRaise the bar until you've locked your elbows."  
    },
    {
        "id": 10,
        "name": "Barbell Curl",
        "type": "Strength",
        "muscle": "Biceps",
        "equipment": "Barbell",
        "difficulty": "Beginner",
        "instructions": "While holding the upper arms stationary, curl the weights forward while contracting the biceps as you breathe out.\nContinue the movement until your biceps are fully contracted and the bar is at shoulder level.\nHold the contracted position for a second and squeeze the biceps hard.\nSlowly bring the weight back down to the starting position."  
    },
    {
        "id": 11,
        "name": "Barbell Reverse Curl",
        "type": "Strength",
        "muscle": "Biceps",
        "equipment": "Barbell",
        "difficulty": "Advanced",
        "instructions": "Take a double overhand grip that's about shoulder width. Flex your elbows while keeping your elbows tucked in. Try not to let them flare out.\nCurl until your forearm presses into your bicep. Then fully extend your elbows at the bottom of each rep."  },
    {
        "id": 12,
        "name": "Barbell Landmine Row",
        "type": "Strength",
        "muscle": "Biceps",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Position a barbell in a landmine or corner of a room and stand facing it with your feet shoulder-width apart.\nGrasp the end of the barbell with a neutral grip, keeping your arms straight and your shoulders relaxed.\nBend at the hips and knees to lower your torso until it is almost parallel to the ground.\nPull the barbell towards your chest, squeezing your shoulder blades together as you row the weight up."  
    },
    {
        "id": 13,
        "name": "Chin Ups",
        "type": "Strength",
        "muscle": "Forearms",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Grab the bar shoulder width apart with a supinated grip (palms facing you)\nWith your body hanging and arms fully extended, pull yourself up until your chin is past the bar.\nSlowly return to starting position. Repeat."  
    },
    {
        "id": 14,
        "name": "Inverted Row",
        "type": "Strength",
        "muscle": "Forearms",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Lay underneath a fixed horizontal bar and grab the bar with a wide overhand grip.\nPull your body straight up to the bar.\nReturn to the starting position, your arms fully extended. Repeat."  
    },
    {
        "id": 15,
        "name": "Barbell Wrist Curl",
        "type": "Strength",
        "muscle": "Forearms",
        "equipment": "Barbell",
        "difficulty": "Beginner",
        "instructions": "Grab a straight bar with a supinated (underhand) grip.\nKneel down next to a flat bench and place your forearms on the bench with your wrists just off the bench.\nLet the barbell pull down on your wrists until they are extended.\nCurl the barbell until your wrists are fully flexed.\nLower in a controlled manner and repeat."  
    },
    {
        "id": 16,
        "name": "Barbell Bent Over Row",
        "type": "Strength",
        "muscle": "Lats",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Grab a barbell with a shoulder width pronated or supinated grip.\nBend forward at your hips while maintaining a flat back.\nPull the weight toward your upper abdomen.\nLower the weight in a controlled manner and repeat."  
    },
    {
        "id": 17,
        "name": "Barbell Meadows Row",
        "type": "Strength",
        "muscle": "Lats",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Position a barbell in a landmine or corner of a room and stand facing sideways with a staggered stance and your feet shoulder-width apart.\nGrasp the end of the barbell with an overhand grip, keeping your arms straight and your shoulders relaxed.\nBend at the hips and knees to lower your torso until it is almost parallel to the ground.\nPull the barbell towards your chest, squeezing your shoulder blades together as you row the weight up.\n*Named after the late John Meadows"  
    },
    {
        "id": 18,
        "name": "Barbell Pronated Pendlay Row",
        "type": "Strength",
        "muscle": "Lats",
        "equipment": "Bodyweight",
        "difficulty": "Advanced",
        "instructions": "Start hinged forward with a flat back and the plates resting on the floor. Make sure your elbows are fully extended.\nPull the bar to your sternum.\n Return the plates back to the floor and let the bar come to a full dead stop.\nThen initiate the next rep."  
    },
    {
        "id": 19,
        "name": "Russian Twist",
        "type": "Strength",
        "muscle": "Obliques",
        "equipment": "Bodyweight",
        "difficulty": "Intermediate",
        "instructions": "Hover your heels just off the ground. Stick your chest out and maintain a flat back. Make all the movement happen at your mid and upper spine. Point your chest to the left, then rotate at the spine until your chest is pointed right."
    },
    {
        "id": 20,
        "name": "Barbell Suitcase Deadlift",
        "type": "Strength",
        "muscle": "Obliques",
        "equipment": "Barbell",
        "difficulty": "Advanced",
        "instructions": "Begin by standing with your feet hip-width apart and holding a barbell at one side of your body, with your palms facing your thighs. Keeping your core engaged and your back straight, bend at the hips and knees to lower the barbell down towards the ground. As the barbell reaches the ground, use your legs and glutes to push through your heels and extend your hips and knees to raise your body back to the starting position. Repeat the movement for the desired number of reps, then switch sides and repeat the exercise with the barbell on the opposite side of your body."
    },
    {
        "id": 21,
        "name": "Abdominals Stretch Variation Two",
        "type": "Stretch",
        "muscle": "Obliques",
        "equipment": "Bodyweight",
        "difficulty": "Advanced",
        "instructions": "Stand upright. Reach with both hands upwards until you can interlock your fingers. With your hands above your head, lean back until a stretch is felt in the abdominals."
    },
    {
        "id": 22,
        "name": "Crunches",
        "type": "Strength",
        "muscle": "Abdominals",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Lay flat on your back with your knees bent and your feet flat on the ground, about a foot from your lower back. Place your fingertips on your temples with your palms facing out. Draw your belly into the base of your spine to engage the muscles, then raise your head and shoulders off the floor. Return to starting position and repeat."
    },
    {
        "id": 23,
        "name": "Barbell Situp",
        "type": "Strength",
        "muscle": "Abdominals",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Hold the bar with a slightly wider than shoulder width grip. Push the bar up toward the ceiling and maintain that elbow extension. Flex your abs and sit-up. Aim to get your torso vertical while maintaining the barbell overhead."
    },
    {
        "id": 24,
        "name": "Abdominals Stretch Variation One",
        "type": "Stretch",
        "muscle": "Abdominals",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Lay on your stomach on the floor with your forearms flat on the ground. Extend your elbows and push your upper body upwards. Push your upper body upwards until you feel a stretch in your abs, then return to the starting position and repeat."
    },
    {
        "id": 25,
        "name": "Glute Bridge",
        "type": "Strength",
        "muscle": "Glutes",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Lie down with your knees bent and your feet flat on the floor. Push your hips up so that your butt is elevated and your back straight. Tense your glutes and raise your hips towards the ceiling. Once you are at the highest point you can manage, hold the position for a few seconds, and then slowly return to the starting position."
    },
    {
        "id": 26,
        "name": "Barbell Deadlift",
        "type": "Strength",
        "muscle": "Glutes",
        "equipment": "Barbell",
        "difficulty": "Advanced",
        "instructions": "Stand with your mid-foot under the bar and grip the bar with your hands, about a shoulder width apart. Bend your knees, then lift the bar by straightening your back. It is important to keep your back straight. Stand to your full height and hold. Lower the bar to the floor by bending your knees and keeping your back straight."
    },
    {
        "id": 27,
        "name": "Glutes Stretch",
        "type": "Stretch",
        "muscle": "Glutes",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "On your front, place one leg forward and then stretch out the same side arm across the mat/floor. Fully extend your leg and arm. Hold at the peak of the stretch, then slowly return to starting position. Switch sides and repeat."
    },
    {
        "id": 28,
        "name": "Kickbacks",
        "type": "Strength",
        "muscle": "Hamstring",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Get down on all fours and position your hands under your shoulders and your knees under your hips. Kick back with one leg and squeeze your glutes.Slowly return to starting position by bending your knee and lowering your leg. Switch Legs. Repeat."
    },
    {
        "id": 29,
        "name": "Barbell Romanian Deadlift",
        "type": "Strength",
        "muscle": "Hamstring",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Take a shoulder width, double overhand or mixed grip. Push your hips back while leaving your knees mostly extended. Look for a stretch in your hamstrings. When you feel the stretch, push your hips forward until you're back in a standing position."
    },
    {
        "id": 30,
        "name": "Hamstrings Stretch",
        "type": "Stretch",
        "muscle": "Hamstring",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Lie down with your legs reaching up the wall. your bum should be slightly off the floor. Bend one leg and leave the other outstretched. Push your thigh towards the wall. Hold the stretch for a few seconds then return to starting position."
    },
    {
        "id": 31,
        "name": "Forward Lunges",
        "type": "Strength",
        "muscle": "Quads",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Step forward with one leg. Lower your body until your rear knee nearly touches the ground. Ensure you remain upright, and your front knee stay above the front foot. Push off the floor with your front foot until you return to the starting position. Switch legs."
    },
    {
        "id": 32,
        "name": "Barbell Squat",
        "type": "Strength",
        "muscle": "Quads",
        "equipment": "Barbell",
        "difficulty": "Advanced",
        "instructions": "Stand with your feet shoulder-width apart. Maintain the natural arch in your back, squeezing your shoulder blades and raising your chest. Grip the bar across your shoulders and support it on your upper back. Unwrack the bar by straightening your legs, and take a step back. Bend your knees as you lower the weight without altering the form of your back until your hips are below your knees. Raise the bar back to starting position, lift with your legs and exhale at the top."
    },
    {
        "id": 33,
        "name": "Quads Stretch",
        "type": "Stretch",
        "muscle": "Quads",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Stand perpendicular to a wall, using one arm against the wall for balance. With your other arm, grab the top of your foot. Pull your leg upwards and back to engage your quads, pausing at the apex of the stretch for a few seconds. Return to starting position and repeat with your other leg."
    },
    {
        "id": 34,
        "name": "Calf Raises",
        "type": "Strength",
        "muscle": "Calves",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Balance on the balls of your feet on the platform or plates, leaning forward to use the wall to assist with balance. Lower the heels of your feet towards the ground and pause, then push through the balls of your feet like you are standing tip toe, pausing at the apex of the motion. Repeat as necessary."
    },
    {
        "id": 35,
        "name": "Barbell Calf Raises",
        "type": "Strength",
        "muscle": "Calves",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Place the bar on your back. Start with feet flat on the ground. Extend your heels upwards while keeping your knees stationary, and pause at the contracted position. Slowly return to the starting position. Repeat."
    },
    {
        "id": 36,
        "name": "Calves Stretch",
        "type": "Stretch",
        "muscle": "Calves",
        "equipment": "Bodyweight",
        "difficulty": "Beginner",
        "instructions": "Place the ball of your foot against the wall with your heel on the ground. Place your hands on the wall in front of your shoulders. Keeping your knee straight, slowly lean towards the wall, pause for a few seconds when you feel the stretch extending through your calf muscle. Return to the starting position, and repeat the stretch with your other leg."
    },
    {
        "id": 37,
        "name": "Barbell Pronated Row",
        "type": "Strength",
        "muscle": "Biceps",
        "equipment": "Barbell",
        "difficulty": "Beginner",
        "instructions": "Grab the barbell with an overhand grip. Hinge forward while keeping your back flat until your torso is about parallel with the ground.\nLet your arms hang freely.\nPull the bar to your torso while tucking your elbows in slightly.\nExtend your elbows fully before initiating the next rep."
    },
    {
        "id": 38,
        "name": "Barbell Landmine Side Bend",
        "type": "Strength",
        "muscle": "Obliques",
        "equipment": "Barbell",
        "difficulty": "Intermediate",
        "instructions": "Stand straight and hold the end of the Barbell\nKeep your hips and shoulders facing forward, bend to one side slowly\nReturn to the upright position.\n Switch hands and repeat."
      },
      {
        "id": 39,
        "name": "Barbell Pronated Row",
        "type": "Strength",
        "muscle": "Biceps",
        "equipment": "Barbell",
        "difficulty": "Beginner",
        "instructions": "Grab the barbell with an overhand grip. Hinge forward while keeping your back flat until your torso is about parallel with the ground.\nLet your arms hang freely.\nPull the bar to your torso while tucking your elbows in slightly.\nExtend your elbows fully before initiating the next rep."
    },
    {
        "id": 40,
        "name": "Barbell Step Up",
        "type": "Strength",
        "muscle": "Quads",
        "equipment": "Barbell",
        "difficulty": "Beginner",
        "instructions": "Begin by standing in front of a sturdy box or bench that is about knee-height, holding a barbell across your upper back and shoulders, using an overhand grip.\nPlace your right foot on the box and push through the heel to lift your body up and onto the box.\nStep back down with your right foot."
      }


    
]